# block_name_list = ['Чемпионат мира 2022. Групповой этап. Катар\nКатар\nЭквадор\n20.11.2022 19:00\n3.52\n3.32\n2.22\n0\n2.48\n0\n1.58\n2.5\n2.29\n1.67\n+459\nАнглия\nИран\n21.11.2022 16:00\n1.33\n5.20\n11.00\n-1.5\n2.03\n1.5\n1.85\n2.5\n2.08\n1.81\n+457\nСенегал\nНидерланды\n21.11.2022 19:00\n5.99\n3.89\n1.64\n1\n1.79\n-1\n2.09\n2.5\n2.08\n1.80\n+465\nСША\nУэльс\n21.11.2022 22:00\n2.54\n3.19\n3.04\n0\n1.78\n0\n2.11\n2.5\n2.48\n1.58\n+455\nАргентина\nСаудовская Аравия\n22.11.2022 13:00\n1.17\n7.50\n20.00\n-2\n1.93\n2\n1.94\n2.5\n1.68\n2.28\n+463\nДания\nТунис\n22.11.2022 16:00\n1.47\n4.39\n8.00\n-1\n1.78\n1\n2.11\n2.5\n2.14\n1.76\n+465\nМексика\nПольша\n22.11.2022 19:00\n2.79\n3.14\n2.79\n0\n1.92\n0\n1.94\n2.5\n2.39\n1.62\n+461\nФранция\nАвстралия\n22.11.2022 22:00\n1.25\n6.39\n13.00\n-1.5\n1.74\n1.5\n2.18\n2.5\n1.66\n2.32\n+465\nМарокко\nХорватия\n23.11.2022 13:00\n4.39\n3.39\n1.95\n1\n1.46\n-1\n2.84\n2.5\n2.32\n1.66\n+457\nГермания\nЯпония\n23.11.2022 16:00\n1.45\n4.87\n7.15\n-1.5\n2.20\n1.5\n1.72\n2.5\n1.67\n2.29\n+467\nИспания\nКоста-Рика\n23.11.2022 19:00\n1.21\n6.74\n16.75\n-2\n2.17\n2\n1.74\n2.5\n1.78\n2.11\n+461\nБельгия\nКанада\n23.11.2022 22:00\n1.37\n5.18\n8.75\n-1.5\n2.04\n1.5\n1.84\n2.5\n1.73\n2.18\n+461\nШвейцария\nКамерун\n24.11.2022 13:00\n1.79\n3.54\n5.19\n-1\n2.48\n1\n1.58\n2.5\n2.46\n1.59\n+453\nУругвай\nЮжная Корея\n24.11.2022 16:00\n1.83\n3.53\n4.87\n-1\n2.59\n1\n1.54\n2.5\n2.43\n1.61\n+453\nПортугалия\nГана\n24.11.2022 19:00\n1.43\n4.48\n8.75\n-1\n1.71\n1\n2.22\n2.5\n2.17\n1.74\n+463\nБразилия\nСербия\n24.11.2022 22:00\n1.48\n4.57\n7.15\n-1\n1.77\n1\n2.13\n2.5\n1.86\n2.01\n+467\nУэльс\nИран\n25.11.2022 13:00\n2.22\n3.19\n3.69\n0\n1.55\n0\n2.56\n2.5\n2.49\n1.58\n+455\nКатар\nСенегал\n25.11.2022 16:00\n3.79\n3.34\n2.12\n0\n2.67\n0\n1.52\n2.5\n2.30\n1.67\n+461\nНидерланды\nЭквадор\n25.11.2022 19:00\n1.67\n4.00\n5.39\n-1\n2.12\n1\n1.78\n2.5\n1.85\n2.03\n+467\nАнглия\nСША\n25.11.2022 22:00\n1.69\n3.78\n5.57\n-1\n2.22\n1\n1.71\n2.5\n2.07\n1.81\n+463\nТунис\nАвстралия\n26.11.2022 13:00\n2.97\n3.07\n2.68\n0\n2.04\n0\n1.84\n1.5\n1.53\n2.62\n+455\nПольша\nСаудовская Аравия\n26.11.2022 16:00\n1.66\n3.83\n5.78\n-1\n2.15\n1\n1.75\n2.5\n2.08\n1.81\n+465\nФранция\nДания\n26.11.2022 19:00\n2.00\n3.37\n4.17\n0\n1.44\n0\n2.92\n2.5\n2.32\n1.66\n+459\nАргентина\nМексика\n26.11.2022 22:00\n1.61\n3.94\n6.18\n-1\n2.07\n1\n1.81\n2.5\n2.17\n1.74\n+455\nЯпония\nКоста-Рика\n27.11.2022 13:00\n1.94\n3.44\n4.39\n-1\n2.83\n1\n1.47\n2.5\n2.41\n1.61\n+455\nБельгия\nМарокко\n27.11.2022 16:00\n1.56\n4.28\n6.17\n-1\n1.94\n1\n1.93\n2.5\n1.90\n1.97\n+463\nХорватия\nКанада\n27.11.2022 19:00\n1.86\n3.64\n4.48\n-1\n2.60\n1\n1.54\n2.5\n2.11\n1.78\n+461\nИспания\nГермания\n27.11.2022 22:00\n2.60\n3.35\n2.85\n0\n1.86\n0\n2.01\n2.5\n1.95\n1.91\n+463\nКамерун\nСербия\n28.11.2022 13:00\n4.08\n3.39\n2.02\n0\n2.88\n0\n1.46\n2.5\n2.48\n1.58\n+453\nЮжная Корея\nГана\n28.11.2022 16:00\n2.63\n3.03\n3.08\n0\n1.79\n0\n2.09\n2.5\n2.60\n1.54\n+451\nБразилия\nШвейцария\n28.11.2022 19:00\n1.54\n4.29\n6.59\n-1\n1.89\n1\n1.98\n2.5\n1.95\n1.91\n+463\nПортугалия\nУругвай\n28.11.2022 22:00\n2.12\n3.34\n3.79\n0\n1.52\n0\n2.66\n2.5\n2.24\n1.70\n+459\nНидерланды\nКатар\n29.11.2022 18:00\n1.32\n5.61\n10.00\n-1.5\n1.90\n1.5\n1.97\n2.5\n1.70\n2.24\n+459\nЭквадор\nСенегал\n29.11.2022 18:00\n2.99\n3.24\n2.55\n0\n2.10\n0\n1.79\n2.5\n2.28\n1.67\n+453\nУэльс\nАнглия\n29.11.2022 22:00\n6.17\n4.08\n1.59\n1\n1.86\n-1\n2.01\n2.5\n2.04\n1.84\n+455\nИран\nСША\n29.11.2022 22:00\n3.48\n3.43\n2.19\n0\n2.49\n0\n1.58\n2.5\n2.13\n1.77\n+388\nАвстралия\nДания\n30.11.2022 18:00\n6.77\n3.74\n1.61\n1\n1.79\n-1\n2.09\n2.5\n2.43\n1.60\n+447\nТунис\nФранция\n30.11.2022 18:00\n15.00\n5.95\n1.25\n1.5\n2.08\n-1.5\n1.81\n2.5\n1.92\n1.94\n+459\nСаудовская Аравия\nМексика\n30.11.2022 22:00\n6.54\n4.26\n1.55\n1\n1.93\n-1\n1.93\n2.5\n2.05\n1.83\n+455\nПольша\nАргентина\n30.11.2022 22:00\n4.77\n4.28\n1.69\n1\n1.68\n-1\n2.27\n2.5\n2.13\n1.77\n+455\nХорватия\nБельгия\n01.12.2022 18:00\n3.99\n3.69\n1.95\n1\n1.48\n-1\n2.79\n2.5\n2.04\n1.84\n+368\nКанада\nМарокко\n01.12.2022 18:00\n3.28\n3.38\n2.30\n0\n2.34\n0\n1.65\n2.5\n2.24\n1.70\n+457\nКоста-Рика\nГермания\n01.12.2022 22:00\n11.00\n5.75\n1.30\n1.5\n1.99\n-1.5\n1.88\n2.5\n1.73\n2.18\n+457\nЯпония\nИспания\n01.12.2022 22:00\n9.75\n5.59\n1.33\n1.5\n1.95\n-1.5\n1.91\n2.5\n1.66\n2.32\n+461\nГана\nУругвай\n02.12.2022 18:00\n4.78\n3.69\n1.80\n1\n1.58\n-1\n2.48\n2.5\n2.18\n1.73\n+368\nЮжная Корея\nПортугалия\n02.12.2022 18:00\n9.25\n4.88\n1.38\n1.5\n1.77\n-1.5\n2.13\n2.5\n1.97\n1.90\n+457\nКамерун\nБразилия\n02.12.2022 22:00\n9.50\n5.39\n1.35\n1.5\n1.87\n-1.5\n2.00\n2.5\n1.76\n2.14\n+453\nСербия\nШвейцария\n02.12.2022 22:00\n2.83\n3.48\n2.53\n0\n2.03\n0\n1.85\n2.5\n2.04\n1.84\n+457']

def split_list(list):
    result = []
    for count, value in enumerate(list):
        splitted = value.split('\\n')
        splitted = value.split('\n')
        # print(f'splitted:\n{splitted}')
        separator = ':'        
        how_many_games = [x for x in splitted if separator in x]
        # print(f'\n\nhow_many_games: {how_many_games}')
        # print(f'\n\nlen(how_many_games): {len(how_many_games)}')
        start_search = 0 
        # print(f'len(splitted): {len(splitted)}')
        for x in range(len(how_many_games)):
            current_position = splitted.index(how_many_games[x], start_search)
            # print(f'\nx: {x}')
            # print(f'how_many_games[x]: {how_many_games[x]}')
            # print(f'start_search: {start_search}')
            # print(f'current_position: {current_position}')
            index_of_date = splitted[current_position].index(' ')
            # print(f'index_of: {index_of_date}')
            date_of_game = splitted[current_position][:index_of_date]
            time_of_game = splitted[current_position][index_of_date+1:]
            result.append(['OlympBet',\
                            'World cup 2022',\
                            date_of_game,\
                            time_of_game,\
                            splitted[current_position - 2],\
                            splitted[current_position - 1],\
                            splitted[current_position + 1],\
                            splitted[current_position + 2],\
                            splitted[current_position + 3]
                            ])
            start_search = current_position + 1        
    # print(f'\nresult:\n {result}')
    return result
    
# split_list(block_name_list)