# block_name_list = ['Чемпионат мира 2022. Групповой этап. Катар\nКатар\nЭквадор\n3.32\n3.12\n2.42\n0\n2.28\n0\n1.68\n2.5\n2.62\n1.53\n+661\n20.11.2022 19:00\nАнглия\nИран\n1.38\n4.79\n10.00\n-1.5\n2.19\n1.5\n1.73\n2.5\n2.26\n1.69\n+637\n21.11.2022 16:00\nСенегал\nНидерланды\n5.97\n3.98\n1.62\n1\n1.79\n-1\n2.09\n2.5\n2.18\n1.73\n+641\n21.11.2022 19:00\nСША\nУэльс\n2.69\n3.04\n2.99\n0\n1.84\n0\n2.03\n2.5\n2.56\n1.55\n+627\n21.11.2022 22:00\nАргентина\nСаудовская Аравия\n1.19\n7.37\n18.00\n-2\n1.98\n2\n1.89\n2.5\n1.67\n2.28\n+567\n22.11.2022 13:00\nДания\nТунис\n1.48\n4.36\n7.75\n-1\n1.81\n1\n2.08\n2.5\n2.14\n1.76\n+561\n22.11.2022 16:00\nМексика\nПольша\n2.73\n3.12\n2.87\n0\n1.89\n0\n1.98\n2.5\n2.46\n1.59\n+567\n22.11.2022 19:00\nФранция\nАвстралия\n1.26\n6.35\n12.00\n-1.5\n1.78\n1.5\n2.11\n2.5\n1.69\n2.26\n+569\n22.11.2022 22:00\nМарокко\nХорватия\n4.07\n3.33\n2.05\n0\n2.87\n0\n1.46\n2.5\n2.37\n1.63\n+559\n23.11.2022 13:00\nГермания\nЯпония\n1.51\n4.58\n6.38\n-1\n1.82\n1\n2.06\n2.5\n1.71\n2.22\n+575\n23.11.2022 16:00\nИспания\nКоста-Рика\n1.16\n7.75\n23.00\n-2\n1.87\n2\n2.00\n2.5\n1.70\n2.24\n+567\n23.11.2022 19:00\nБельгия\nКанада\n1.49\n4.66\n6.74\n-1\n1.78\n1\n2.11\n2.5\n1.78\n2.11\n+571\n23.11.2022 22:00\nШвейцария\nКамерун\n1.74\n3.54\n5.58\n-1\n2.36\n1\n1.63\n2.5\n2.40\n1.62\n+559\n24.11.2022 13:00\nУругвай\nЮжная Корея\n1.80\n3.52\n5.16\n-1\n2.50\n1\n1.57\n2.5\n2.36\n1.63\n+561\n24.11.2022 16:00\nПортугалия\nГана\n1.42\n4.59\n9.00\n-1.5\n2.26\n1.5\n1.69\n2.5\n2.17\n1.74\n+567\n24.11.2022 19:00\nБразилия\nСербия\n1.44\n4.77\n7.50\n-1\n1.70\n1\n2.24\n2.5\n1.83\n2.05\n+565\n24.11.2022 22:00\nУэльс\nИран\n2.35\n3.14\n3.44\n0\n1.62\n0\n2.39\n2.5\n2.49\n1.58\n+463\n25.11.2022 13:00\nКатар\nСенегал\n3.88\n3.33\n2.10\n0\n2.72\n0\n1.50\n2.5\n2.36\n1.64\n+467\n25.11.2022 16:00\nНидерланды\nЭквадор\n1.63\n4.06\n5.75\n-1\n2.08\n1\n1.81\n2.5\n1.94\n1.92\n+467\n25.11.2022 19:00\nАнглия\nСША\n1.61\n3.98\n6.16\n-1\n2.04\n1\n1.84\n2.5\n2.07\n1.81\n+469\n25.11.2022 22:00\nТунис\nАвстралия\n2.84\n3.14\n2.74\n0\n1.97\n0\n1.90\n2.5\n2.51\n1.57\n+467\n26.11.2022 13:00\nПольша\nСаудовская Аравия\n1.65\n3.84\n5.99\n-1\n2.13\n1\n1.77\n2.5\n2.13\n1.77\n+473\n26.11.2022 16:00\nФранция\nДания\n2.03\n3.38\n4.07\n0\n1.46\n0\n2.84\n2.5\n2.27\n1.68\n+467\n26.11.2022 19:00\nАргентина\nМексика\n1.57\n4.06\n6.53\n-1\n2.01\n1\n1.86\n2.5\n2.17\n1.74\n+461\n26.11.2022 22:00\nЯпония\nКоста-Рика\n1.69\n3.72\n5.76\n-1\n2.26\n1\n1.69\n2.5\n2.32\n1.66\n+468\n27.11.2022 13:00\nБельгия\nМарокко\n1.58\n4.27\n5.96\n-1\n1.98\n1\n1.89\n2.5\n1.90\n1.97\n+469\n27.11.2022 16:00\nХорватия\nКанада\n1.80\n3.74\n4.69\n-1\n2.48\n1\n1.58\n2.5\n2.11\n1.78\n+471\n27.11.2022 19:00\nИспания\nГермания\n2.62\n3.41\n2.77\n0\n1.86\n0\n2.01\n2.5\n1.94\n1.92\n+477\n27.11.2022 22:00\nКамерун\nСербия\n4.68\n3.48\n1.87\n1\n1.53\n-1\n2.62\n2.5\n2.36\n1.64\n+461\n28.11.2022 13:00\nЮжная Корея\nГана\n2.69\n3.09\n2.94\n0\n1.85\n0\n2.03\n2.5\n2.60\n1.54\n+459\n28.11.2022 16:00\nБразилия\nШвейцария\n1.52\n4.39\n6.78\n-1\n1.85\n1\n2.03\n2.5\n1.92\n1.95\n+473\n28.11.2022 19:00\nПортугалия\nУругвай\n2.15\n3.34\n3.69\n0\n1.54\n0\n2.60\n2.5\n2.24\n1.70\n+467\n28.11.2022 22:00\nНидерланды\nКатар\n1.27\n6.18\n12.00\n-1.5\n1.78\n1.5\n2.11\n2.5\n1.67\n2.28\n+475\n29.11.2022 18:00\nЭквадор\nСенегал\n2.74\n3.29\n2.74\n0\n1.94\n0\n1.92\n2.5\n2.28\n1.67\n+465\n29.11.2022 18:00\nУэльс\nАнглия\n5.98\n4.09\n1.60\n1\n1.85\n-1\n2.03\n2.5\n1.99\n1.88\n+467\n29.11.2022 22:00\nИран\nСША\n3.98\n3.43\n2.03\n0\n2.84\n0\n1.46\n2.5\n2.17\n1.74\n+471\n29.11.2022 22:00\nАвстралия\nДания\n6.39\n4.09\n1.58\n1\n1.89\n-1\n1.98\n2.5\n2.11\n1.78\n+467\n30.11.2022 18:00\nТунис\nФранция\n10.75\n5.33\n1.32\n1.5\n1.87\n-1.5\n2.00\n2.5\n1.92\n1.94\n+469\n30.11.2022 18:00\nСаудовская Аравия\nМексика\n5.57\n3.78\n1.69\n1\n1.72\n-1\n2.21\n2.5\n2.05\n1.83\n+471\n30.11.2022 22:00\nПольша\nАргентина\n5.16\n3.97\n1.70\n1\n1.71\n-1\n2.22\n2.5\n1.94\n1.92\n+471\n30.11.2022 22:00\nХорватия\nБельгия\n3.42\n3.47\n2.20\n0\n2.44\n0\n1.60\n2.5\n2.05\n1.83\n+469\n01.12.2022 18:00\nКанада\nМарокко\n3.03\n3.33\n2.47\n0\n2.14\n0\n1.76\n2.5\n2.24\n1.70\n+469\n01.12.2022 18:00\nКоста-Рика\nГермания\n14.00\n6.19\n1.25\n1.5\n2.15\n-1.5\n1.75\n2.5\n1.73\n2.18\n+471\n01.12.2022 22:00\nЯпония\nИспания\n7.75\n4.99\n1.42\n1.5\n1.76\n-1.5\n2.14\n2.5\n1.73\n2.19\n+475\n01.12.2022 22:00\nГана\nУругвай\n4.69\n3.64\n1.83\n1\n1.56\n-1\n2.53\n2.5\n2.19\n1.73\n+471\n02.12.2022 18:00\nЮжная Корея\nПортугалия\n6.75\n4.47\n1.51\n1\n2.03\n-1\n1.85\n2.5\n1.91\n1.95\n+473\n02.12.2022 18:00\nКамерун\nБразилия\n12.00\n5.78\n1.28\n1.5\n2.20\n-1.5\n1.72\n2.5\n1.66\n2.32\n+471\n02.12.2022 22:00\nСербия\nШвейцария\n2.79\n3.34\n2.64\n0\n1.98\n0\n1.89\n2.5\n2.13\n1.77\n+469\n02.12.2022 22:00']

def split_list(list, parsing_date):
    result = []
    for count, value in enumerate(list):
        splitted = value.split('\\n')
        splitted = value.split('\n')
        # print(f'\nsplitted:\n{splitted}\n')
        separator = ':'        
        how_many_games = [x for x in splitted if separator in x]
        # print(f'\n\nhow_many_games: {how_many_games}')
        # print(f'\n\nlen(how_many_games): {len(how_many_games)}')
        start_search = 0 
        # print(f'len(splitted): {len(splitted)}')
        
        for x in range(len(how_many_games)):
            current_position = splitted.index(how_many_games[x], start_search)
            # print(f'\nx: {x}')
            # print(f'how_many_games[x]: {how_many_games[x]}')
            # print(f'start_search: {start_search}')
            # print(f'current_position: {current_position}')
            index_of_date = splitted[current_position].index(' ')
            # print(f'index_of: {index_of_date}')
            date_of_game = splitted[current_position][:index_of_date]
            time_of_game = splitted[current_position][index_of_date+1:]
            team_A = splitted[current_position - 13]
            # print(f'splitted[current_position - 13]: {splitted[current_position - 13]}')
            # print(f'team_A: {team_A}')
            team_B = splitted[current_position - 12]
            # print(f'splitted[current_position - 12]: {splitted[current_position - 12]}')
            # print(f'team_B: {team_B}')
            w1 = splitted[current_position - 11]
            draw = splitted[current_position - 10]
            w2 = splitted[current_position - 9]
            result.append(['OlympBet',\
                            'World cup 2022',\
                            date_of_game,\
                            time_of_game,\
                            team_A,\
                            team_B,\
                            w1,\
                            draw,\
                            w2,\
                            parsing_date
                            ])
            start_search = current_position + 1
        
    # print(f'\nresult:\n {result}')
    return result
    
# split_list(block_name_list, '16/11/2022 23:00:00')