# block_name_list = ['Футбол\nИСХОДЫ\nДВОЙНОЙ ИСХОД\nФОРЫ\nТОТАЛЫ\nЧЕМПИОНАТ МИРА 2022. КАТАР. ГРУППОВАЯ СТАДИЯ\n1\nX\n2\n1X\n12\nX2\nФОРА 1\nФОРА 2\nТОТАЛ\nБ\nМ\nКатар — Эквадор\n20 ноября в 19:00\n3.70\n3.25\n2.15\n1.72\n1.35\n1.30\n0\u2008\u20072.55\n0\u2008\u20071.53\n2.5\n2.35\n1.60\n+634\nАнглия — Иран\n21 ноября в 16:00\n1.30\n4.90\n12.50\n1.03\n1.19\n3.60\n-1.52.02\n+1.51.82\n2.5\n2.05\n1.78\n+595\nСенегал — Нидерланды\n21 ноября в 19:00\n6.60\n3.80\n1.58\n2.40\n1.28\n1.12\n+1\u2008\u20071.82\n-1\u2008\u20072.00\n2.5\n2.08\n1.77\n+636\nСША — Уэльс\n21 ноября в 22:00\n2.60\n3.05\n3.00\n1.40\n1.40\n1.50\n0\u2008\u20071.80\n0\u2008\u20072.05\n2.5\n2.50\n1.55\n+634\nАргентина — Саудовская Аравия\n22 ноября в 13:00\n1.16\n7.40\n21.00\n-\n1.10\n5.40\n-2.52.40\n+2.51.58\n2.5\n1.62\n2.30\n+597\nДания — Тунис\n22 ноября в 16:00\n1.45\n4.20\n8.00\n1.08\n1.25\n2.80\n-1\u2008\u20071.78\n+1\u2008\u20072.05\n2.5\n2.10\n1.75\n+601\nМексика — Польша\n22 ноября в 19:00\n2.75\n3.15\n2.75\n1.45\n1.37\n1.45\n0\u2008\u20071.90\n0\u2008\u20071.90\n2.5\n2.45\n1.57\n+634\nФранция — Австралия\n22 ноября в 22:00\n1.22\n6.30\n15.00\n1.02\n1.13\n4.40\n-1.51.70\n+1.52.18\n2.5\n1.65\n2.30\n+606\nМарокко — Хорватия\n23 ноября в 13:00\n4.70\n3.30\n1.88\n1.95\n1.35\n1.20\n+1\u2008\u20071.43\n-1\u2008\u20072.85\n2.5\n2.35\n1.62\n+640\nГермания — Япония\n23 ноября в 16:00\n1.43\n4.70\n7.50\n1.09\n1.20\n2.90\n-1.52.20\n+1.51.70\n2.5\n1.68\n2.20\n+615\nИспания — Коста-Рика\n23 ноября в 19:00\n1.20\n6.30\n17.00\n1.01\n1.13\n4.70\n-1.51.67\n+1.52.25\n2.5\n1.77\n2.08\n+594\nБельгия — Канада\n23 ноября в 22:00\n1.37\n4.90\n9.00\n1.07\n1.19\n3.15\n-1.52.05\n+1.51.80\n2.5\n1.75\n2.10\n+606\nШвейцария — Камерун\n24 ноября в 13:00\n1.72\n3.50\n5.50\n1.16\n1.30\n2.15\n-1\u2008\u20072.50\n+1\u2008\u20071.55\n2.5\n2.40\n1.58\n+631\nУругвай — Южная Корея\n24 ноября в 16:00\n1.75\n3.55\n5.30\n1.16\n1.30\n2.10\n-1\u2008\u20072.55\n+1\u2008\u20071.55\n2.5\n2.30\n1.62\n+637\nПортугалия — Гана\n24 ноября в 19:00\n1.40\n4.40\n9.00\n1.07\n1.22\n3.00\n-1\u2008\u20071.67\n+1\u2008\u20072.25\n2.5\n2.10\n1.75\n+600\nБразилия — Сербия\n24 ноября в 22:00\n1.45\n4.40\n7.60\n1.09\n1.22\n2.80\n-1\u2008\u20071.75\n+1\u2008\u20072.08\n2.5\n1.85\n1.97\n+609\nУэльс — Иран\n25 ноября в 13:00\n2.25\n3.05\n3.65\n1.30\n1.40\n1.65\n0\u2008\u20071.55\n0\u2008\u20072.50\n2.5\n2.45\n1.55\n+633\nКатар — Сенегал\n25 ноября в 16:00\n3.80\n3.15\n2.15\n1.72\n1.37\n1.28\n0\u2008\u20072.60\n0\u2008\u20071.52\n2.5\n2.30\n1.63\n+639\nНидерланды — Эквадор\n25 ноября в 19:00\n1.65\n3.95\n5.40\n1.16\n1.25\n2.25\n-1\u2008\u20072.12\n+1\u2008\u20071.75\n2.5\n1.82\n2.00\n+646\nАнглия — США\n25 ноября в 22:00\n1.65\n3.90\n5.60\n1.15\n1.25\n2.25\n-1\u2008\u20072.15\n+1\u2008\u20071.72\n2.5\n2.02\n1.80\n+640\nТунис — Австралия\n26 ноября в 13:00\n2.85\n3.00\n2.75\n1.45\n1.40\n1.45\n0\u2008\u20071.93\n0\u2008\u20071.90\n1.5\n1.57\n2.45\n+635\nПольша — Саудовская Аравия\n26 ноября в 16:00\n1.63\n3.85\n5.70\n1.15\n1.27\n2.30\n-1\u2008\u20072.10\n+1\u2008\u20071.75\n2.5\n2.00\n1.82\n+640\nФранция — Дания\n26 ноября в 19:00\n2.00\n3.35\n3.95\n1.25\n1.35\n1.83\n0\u2008\u20071.45\n0\u2008\u20072.75\n2.5\n2.20\n1.70\n+644\nАргентина — Мексика\n26 ноября в 22:00\n1.57\n3.90\n6.40\n1.12\n1.25\n2.45\n-1\u2008\u20072.02\n+1\u2008\u20071.80\n2.5\n2.10\n1.75\n+634\nЯпония — Коста-Рика\n27 ноября в 13:00\n1.85\n3.35\n4.70\n1.20\n1.35\n1.97\n-1\u2008\u20072.85\n+1\u2008\u20071.45\n2.5\n2.30\n1.63\n+641\nБельгия — Марокко\n27 ноября в 16:00\n1.53\n4.20\n6.40\n1.12\n1.25\n2.55\n-1\u2008\u20071.93\n+1\u2008\u20071.90\n2.5\n1.90\n1.92\n+646\nХорватия — Канада\n27 ноября в 19:00\n1.77\n3.80\n4.60\n1.20\n1.28\n2.07\n-1\u2008\u20072.40\n+1\u2008\u20071.60\n2.5\n2.05\n1.80\n+642\nИспания — Германия\n27 ноября в 22:00\n2.55\n3.35\n2.80\n1.45\n1.35\n1.53\n0\u2008\u20071.83\n0\u2008\u20072.00\n2.5\n1.90\n1.90\n+646\nКамерун — Сербия\n28 ноября в 13:00\n4.40\n3.40\n1.90\n1.92\n1.33\n1.22\n+1\u2008\u20071.40\n-1\u2008\u20072.95\n2.5\n2.40\n1.60\n+637\nЮжная Корея — Гана\n28 ноября в 16:00\n2.70\n2.95\n2.95\n1.40\n1.40\n1.48\n0\u2008\u20071.82\n0\u2008\u20072.00\n1.5\n1.55\n2.45\n+632\nБразилия — Швейцария\n28 ноября в 19:00\n1.50\n4.20\n7.20\n1.10\n1.25\n2.65\n-1\u2008\u20071.85\n+1\u2008\u20072.00\n2.5\n1.90\n1.92\n+646\nПортугалия — Уругвай\n28 ноября в 22:00\n2.08\n3.35\n3.70\n1.30\n1.35\n1.77\n0\u2008\u20071.50\n0\u2008\u20072.60\n2.5\n2.15\n1.70\n+642\nЭквадор — Сенегал\n29 ноября в 18:00\n2.95\n3.20\n2.55\n1.53\n1.35\n1.40\n0\u2008\u20072.05\n0\u2008\u20071.80\n2.5\n2.25\n1.65\n+638\nНидерланды — Катар\n29 ноября в 18:00\n1.32\n5.20\n10.00\n1.06\n1.17\n3.45\n-1.51.88\n+1.51.95\n2.5\n1.70\n2.20\n+610\nУэльс — Англия\n29 ноября в 22:00\n6.10\n4.00\n1.58\n2.40\n1.25\n1.13\n+1\u2008\u20071.85\n-1\u2008\u20071.98\n2.5\n2.02\n1.80\n+640\nИран — США\n29 ноября в 22:00\n3.45\n3.35\n2.15\n1.72\n1.35\n1.32\n0\u2008\u20072.45\n0\u2008\u20071.55\n2.5\n2.10\n1.75\n+644\nАвстралия — Дания\n30 ноября в 18:00\n6.70\n3.70\n1.60\n2.35\n1.30\n1.11\n+1\u2008\u20071.78\n-1\u2008\u20072.05\n2.5\n2.40\n1.60\n+624\nТунис — Франция\n30 ноября в 18:00\n14.00\n5.60\n1.25\n4.05\n1.15\n1.02\n+1.52.05\n-1.51.80\n2.5\n1.90\n1.92\n+589\nПольша — Аргентина\n30 ноября в 22:00\n5.00\n4.00\n1.68\n2.20\n1.25\n1.18\n+1\u2008\u20071.67\n-1\u2008\u20072.25\n2.5\n2.10\n1.75\n+638\nСаудовская Аравия — Мексика\n30 ноября в 22:00\n6.40\n4.15\n1.55\n2.50\n1.25\n1.12\n+1\u2008\u20071.92\n-1\u2008\u20071.90\n2.5\n2.03\n1.80\n+635\nКанада — Марокко\n1 декабря в 18:00\n3.25\n3.30\n2.30\n1.63\n1.35\n1.35\n0\u2008\u20072.30\n0\u2008\u20071.65\n2.5\n2.20\n1.70\n+638\nХорватия — Бельгия\n1 декабря в 18:00\n3.95\n3.65\n1.90\n1.92\n1.30\n1.25\n+1\u2008\u20071.45\n-1\u2008\u20072.80\n2.5\n2.02\n1.80\n+648\nКоста-Рика — Германия\n1 декабря в 22:00\n10.50\n5.30\n1.30\n3.60\n1.16\n1.05\n+1.51.95\n-1.51.85\n2.5\n1.72\n2.15\n+608\nЯпония — Испания\n1 декабря в 22:00\n10.00\n5.40\n1.30\n3.60\n1.16\n1.06\n+1.51.92\n-1.51.90\n2.5\n1.65\n2.30\n+614\nГана — Уругвай\n2 декабря в 18:00\n4.80\n3.60\n1.78\n2.05\n1.30\n1.19\n+1\u2008\u20071.53\n-1\u2008\u20072.55\n2.5\n2.15\n1.72\n+639\nЮжная Корея — Португалия\n2 декабря в 18:00\n9.00\n4.70\n1.38\n3.10\n1.20\n1.07\n+1.51.75\n-1.52.12\n2.5\n1.95\n1.88\n+605\nКамерун — Бразилия\n2 декабря в 22:00\n9.50\n5.20\n1.35\n3.25\n1.17\n1.06\n+1.51.85\n-1.51.98\n2.5\n1.75\n2.10\n+604\nСербия — Швейцария\n2 декабря в 22:00\n2.80\n3.45\n2.50\n1.55\n1.32\n1.45\n0\u2008\u20072.00\n0\u2008\u20071.82\n2.5\n2.02\n1.80\n+643']

def split_list(list, parsing_date):
    result = []
    for count, value in enumerate(list):
        splitted = value.split('\\n')
        splitted = value.split('\n')
        # print(f'splitted:\n{splitted}')
        separator = ':'        
        how_many_games = [x for x in splitted if separator in x]
        # print(f'\n\nhow_many_games: {how_many_games}')
        # print(f'\n\nlen(how_many_games): {len(how_many_games)}')
        start_search = 0 
        # print(f'len(splitted): {len(splitted)}')           
        for x in range(len(how_many_games)):
            current_position = splitted.index(how_many_games[x], start_search)
            # print(f'\nx: {x}')
            # print(f'how_many_games[x]: {how_many_games[x]}')
            # print(f'start_search: {start_search}')
            # print(f'current_position: {current_position}')
            index_of_date = splitted[current_position].index('в')
            # print(f'index_of: {index_of_date}')
            date_of_game = splitted[current_position][:index_of_date-1]
            time_of_game = splitted[current_position][index_of_date+1:]
            # print(f'date_of_game: {date_of_game}')
            # print(f'time_of_game: {time_of_game}')
            # print(f'splitted[current_position - 1]: {splitted[current_position - 1]}')
            index_of_team = splitted[current_position - 1].index('—')
            team_A = splitted[current_position - 1][:index_of_team-1]
            team_B = splitted[current_position - 1][index_of_team+1:]            
            result.append(['Pari',\
                            'World cup 2022',\
                            date_of_game,\
                            time_of_game,\
                            team_A,\
                            team_B,\
                            splitted[current_position + 1],\
                            splitted[current_position + 2],\
                            splitted[current_position + 3],\
                            parsing_date
                            ])
            
            start_search = current_position + 1        
    # print(f'\nresult:\n {result}')
    return result
    
# split_list(block_name_list)