# block_name_list = [' Футбол. Мир. ЧМ-2022. Групповой этап. Катар.\nСобытие\n1\nХ\n2\n1Х\n12\nХ2\nФора\n1\nФора\n2\nМ\nТотал\nБ\nДоп\n 20/11 19:00\nКатар\nЭквадор\n3,70 3,30 2,22 1,71 1,37 1,30 0 2,65 0 1,55 1,62 2.5 2,45 +472\n 21/11 16:00\nАнглия\nИран\n1,33 5,10 13,00 1,04 1,19 3,50 -1.5 2,05 1.5 1,85 1,82 2.5 2,10 +471\n 21/11 19:00\nСенегал\nНидерланды\n6,50 4,00 1,62 2,40 1,27 1,13 1 1,80 -1 2,13 1,78 2.5 2,15 +474\n 21/11 22:00\nСША\nУэльс\n2,65 3,10 3,05 1,41 1,40 1,52 0 1,82 0 2,10 1,57 2.5 2,60 +465\n 22/11 13:00\nАргентина\nСаудовская Аравия\n1,16 8,00 25,00 1,10 5,70 -2 1,90 2 2,00 1,85 3 2,05 +440\n 22/11 16:00\nДания\nТунис\n1,47 4,40 8,50 1,09 1,23 2,80 -1 1,85 1 2,05 1,75 2.5 2,20 +472\n 22/11 19:00\nМексика\nПольша\n2,90 3,10 2,75 1,48 1,40 1,45 0 2,00 0 1,90 1,62 2.5 2,45 +471\n 22/11 22:00\nФранция\nАвстралия\n1,23 6,40 17,00 1,02 1,13 4,50 -1.5 1,72 1.5 2,25 1,82 3 2,10 +473\n 23/11 13:00\nМарокко\nХорватия\n4,60 3,60 1,90 1,95 1,32 1,22 0 3,30 0 1,38 1,65 2.5 2,40 +476\n 23/11 16:00\nГермания\nЯпония\n1,47 4,80 7,30 1,11 1,20 2,80 -1 1,75 1 2,20 1,75 3 2,20 +484\n 23/11 19:00\nИспания\nКоста-Рика\n1,22 6,40 20,00 1,01 1,13 4,60 -1.5 1,72 1.5 2,25 2,10 2.5 1,82 +447\n 23/11 22:00\nБельгия\nКанада\n1,40 5,20 8,50 1,09 1,18 3,10 -1.5 2,15 1.5 1,78 2,13 2.5 1,80 +477\n 24/11 13:00\nШвейцария\nКамерун\n1,72 3,70 5,70 1,16 1,30 2,20 -1 2,50 1 1,60 1,62 2.5 2,45 +470\n 24/11 16:00\nУругвай\nЮжная Корея\n1,78 3,60 5,40 1,17 1,32 2,10 -1 2,55 1 1,58 1,65 2.5 2,40 +472\n 24/11 19:00\nПортугалия\nГана\n1,45 4,50 9,00 1,08 1,23 2,90 -1 1,75 1 2,20 1,78 2.5 2,15 +468\n 24/11 22:00\nБразилия\nСербия\n1,47 4,60 7,80 1,10 1,22 2,80 -1 1,80 1 2,13 2,00 2.5 1,90 +477\n 25/11 13:00\nУэльс\nИран\n2,30 3,10 3,70 1,30 1,40 1,67 0 1,58 0 2,55 1,62 2.5 2,45 +474\n 25/11 16:00\nКатар\nСенегал\n3,80 3,30 2,20 1,72 1,37 1,29 0 2,60 0 1,57 1,67 2.5 2,35 +475\n 25/11 19:00\nНидерланды\nЭквадор\n1,65 4,20 5,50 1,17 1,25 2,35 -1 2,10 1 1,82 2,13 2.5 1,80 +483\n 25/11 22:00\nАнглия\nСША\n1,67 4,10 5,60 1,16 1,26 2,30 -1 2,25 1 1,72 1,85 2.5 2,05 +476\n 26/11 13:00\nТунис\nАвстралия\n3,00 3,05 2,75 1,48 1,41 1,42 0 2,05 0 1,85 1,57 2.5 2,60 +469\n 26/11 16:00\nПольша\nСаудовская Аравия\n1,65 4,00 5,90 1,15 1,27 2,35 -1 2,15 1 1,78 1,85 2.5 2,05 +480\n 26/11 19:00\nФранция\nДания\n2,03 3,50 4,10 1,26 1,33 1,83 0 1,45 0 2,95 1,72 2.5 2,25 +475\n 26/11 22:00\nАргентина\nМексика\n1,60 4,10 6,40 1,13 1,26 2,45 -1 2,15 1 1,78 1,80 2.5 2,13 +482\n 27/11 13:00\nЯпония\nКоста-Рика\n1,90 3,60 4,60 1,22 1,32 1,95 0 1,38 0 3,30 1,65 2.5 2,40 +476\n 27/11 16:00\nБельгия\nМарокко\n1,57 4,30 6,50 1,13 1,24 2,50 -1 2,00 1 1,90 1,90 2.5 2,00 +480\n 27/11 19:00\nХорватия\nКанада\n1,80 3,80 4,80 1,20 1,29 2,08 0 1,35 0 3,50 1,82 2.5 2,10 +480\n 27/11 22:00\nИспания\nГермания\n2,65 3,30 2,90 1,45 1,37 1,52 0 1,85 0 2,05 1,95 2.5 1,95 +486\n 28/11 13:00\nКамерун\nСербия\n4,50 3,60 1,90 1,95 1,32 1,23 0 3,30 0 1,38 1,62 2.5 2,45 +476\n 28/11 16:00\nЮжная Корея\nГана\n2,65 3,10 3,05 1,41 1,40 1,52 0 1,82 0 2,10 1,57 2.5 2,60 +465\n 28/11 19:00\nБразилия\nШвейцария\n1,50 4,50 7,30 1,11 1,23 2,70 -1 1,85 1 2,05 2,00 2.5 1,90 +475\n 28/11 22:00\nПортугалия\nУругвай\n2,12 3,40 3,80 1,29 1,35 1,77 0 1,52 0 2,75 1,70 2.5 2,30 +476\n 29/11 18:00\nНидерланды\nКатар\n1,35 5,20 11,00 1,06 1,18 3,40 -1.5 2,00 1.5 1,90 2,25 2.5 1,72 +482\n 29/11 18:00\nЭквадор\nСенегал\n3,10 3,20 2,55 1,55 1,38 1,40 0 2,15 0 1,78 1,70 2.5 2,30 +473\n 29/11 22:00\nИран\nСША\n3,60 3,50 2,18 1,73 1,33 1,32 0 2,60 0 1,57 1,80 2.5 2,13 +484\n 29/11 22:00\nУэльс\nАнглия\n6,10 4,10 1,62 2,40 1,26 1,14 1 1,85 -1 2,05 1,85 2.5 2,05 +478\n 30/11 18:00\nАвстралия\nДания\n6,70 3,90 1,62 2,40 1,28 1,13 1 1,82 -1 2,10 1,62 2.5 2,45 +466\n 30/11 18:00\nТунис\nФранция\n15,00 5,60 1,28 3,90 1,16 1,03 1.5 2,15 -1.5 1,78 2,00 2.5 1,90 +448\n 30/11 22:00\nПольша\nАргентина\n5,20 4,10 1,70 2,25 1,26 1,18 1 1,72 -1 2,25 1,78 2.5 2,15 +474\n 30/11 22:00\nСаудовская Аравия\nМексика\n6,20 4,40 1,58 2,48 1,23 1,14 1 1,85 -1 2,05 1,82 2.5 2,10 +472\n 01/12 18:00\nКанада\nМарокко\n3,40 3,20 2,40 1,62 1,38 1,35 0 2,35 0 1,67 1,72 2.5 2,25 +473\n 01/12 18:00\nХорватия\nБельгия\n4,10 3,70 1,95 1,90 1,30 1,26 0 3,05 0 1,43 1,85 2.5 2,05 +483\n 01/12 22:00\nКоста-Рика\nГермания\n12,00 5,40 1,32 3,60 1,17 1,05 1.5 2,00 -1.5 1,90 2,20 2.5 1,75 +475\n 01/12 22:00\nЯпония\nИспания\n10,00 5,40 1,35 3,40 1,17 1,07 1.5 1,95 -1.5 1,95 2,35 2.5 1,67 +478\n 02/12 18:00\nГана\nУругвай\n4,80 3,70 1,83 2,03 1,30 1,20 0 3,50 0 1,35 1,75 2.5 2,20 +478\n 02/12 18:00\nЮжная Корея\nПортугалия\n11,50 4,80 1,37 3,30 1,20 1,05 1.5 1,78 -1.5 2,15 1,90 2.5 2,00 +470\n 02/12 22:00\nКамерун\nБразилия\n9,70 5,20 1,37 3,30 1,18 1,07 1.5 1,85 -1.5 2,05 2,15 2.5 1,78 +476\n 02/12 22:00\nСербия\nШвейцария\n2,90 3,60 2,50 1,57 1,32 1,45 0 2,10 0 1,82 1,85 2.5 2,05 +488']

def split_list(list):
    result = []
    for count, value in enumerate(list):
        splitted = value.split('\\n')
        splitted = value.split('\n')
        # print(f'splitted:\n{splitted}')
        separator = ':'        
        
        how_many_games = [x for x in splitted if separator in x]
        # print(f'\n\nhow_many_games: {how_many_games}')
        # print(f'\n\nlen(how_many_games): {len(how_many_games)}')
        start_search = 0 
        # print(f'len(splitted): {len(splitted)}')
        for x in range(len(how_many_games)):
            current_position = splitted.index(how_many_games[x], start_search)
            # print(f'\nx: {x}')
            # print(f'how_many_games[x]: {how_many_games[x]}')
            # print(f'start_search: {start_search}')
            # print(f'current_position: {current_position}')  
            index_of_date = splitted[current_position].index(':')  
            date_of_game = splitted[current_position][:index_of_date-3]
            time_of_game = splitted[current_position][index_of_date-2:]
            # print(f'index_of_date: {index_of_date}')
            # print(f'date_of_game: {date_of_game}')
            # print(f'time_of_game: {time_of_game}')
            index_of_rate_1 = splitted[current_position + 3].index(' ')
            index_of_rate_2 = splitted[current_position + 3].index(' ', index_of_rate_1 + 1)
            rate_1 = splitted[current_position + 3][:index_of_rate_1]
            rate_2 = splitted[current_position + 3][index_of_rate_1:index_of_rate_2]
            rate_3 = splitted[current_position + 3][index_of_rate_2:index_of_rate_2 + 5]
            # print(f'\nsplitted[current_position + 3]: {splitted[current_position + 3]}')
            # print(f'index_of_rate_1: {index_of_rate_1}')
            # print(f'index_of_rate_2: {index_of_rate_2}')
            # print(f'rate_1: {rate_1}')
            # print(f'rate_2: {rate_2}')
            # print(f'rate_3: {rate_3}')
                    
            result.append(['ZenitBet',\
                            'World cup 2022',\
                            date_of_game,\
                            time_of_game,\
                            splitted[current_position + 1],\
                            splitted[current_position + 2],\
                            rate_1,\
                            rate_2,\
                            rate_3
                            ])
            start_search = current_position + 1
            
        
    # print(f'\nresult:\n {result}')
    return result
    
# split_list(block_name_list)